[
    {
        "name": "Alexander Jackson",
        "review": "Very responsive!!! My laptop broke at 6 pm and by 7 Chris had diagnosed the issue and started repairs. The entire interaction was professional and friendly, and his prices are very reasonable. I highly recommend his services to solve any issues your computer has."
    },
    {
        "name": "Joe Masterleo",
        "review": "Having called on Chris in the past, we recently phone himm with a Roku TV dilemma from our winter residence in Florida. Though it was well into the evening, he answered right away and spent over an hour patiently walking us through how to remedy same on our end. Again, as before, we benefitted appreciatively from his know-how, experience and ready availability attending to our electronic service needs. In each instance, we have experienced prompt and friendly, service. Chris has a great fund of tech knowledge and repair know-how at customer friendly prices. Is very willing to offer his advice and expertise in how to best maintain your particular device after the fact. Provided expert same day service on my laptop, volunteering a brief tutorial on crucial info I never knew about it. Very patient and informative for a non-tech customer like me."
    },
    {
        "name": "Ruth Wraight-Masterleo",
        "review": "Chris is exceptionally skilled. We’re seasonal residents and needed a printer. Chris advised us on what printer to buy given our needs. He is prompt and responsive to customer technical questions and concerns. He is friendly and professional."
    },
    {
        "name": "Jeff Burris",
        "review": "A big THANK YOU to Chris for everything. After I fumbled like a fool for days, he set up my new Mac and transferred info from my pervious computer, with no troubles at all. I run a business at home and I have no time for a computer that's not set up or working properly. This will never again be a concern thanks to Chris. He's prompt, polite, most competent and most helpful when it comes to directing me towards the best course of action. Although he only worked for me for a few hours, I'm proud to consider him an employee. I have a feeling well be hearing from one another quite frequently."
    },
    {
        "name": "Don Henry",
        "review": "First, I was able to get an appointment within 2 days to address my laptop issue, which had crashed. Second, Chris resolved my problem very quickly, taking more time than he charged me to ensure it was properly fixed - and he did an excellent job, as my laptop is working better than ever! Last, with his recommendation regarding PC security, I am now able to protect my laptop while spending less money. Thank you, Chris!"
    }
]
